{
  "architectures": [
    "MusicgenForConditionalGeneration"
  ],
  "audio_encoder": {
    "_name_or_path": "facebook/encodec_32khz",
    "architectures": [
      "EncodecModel"
    ],
    "audio_channels": 1,
    "chunk_length_s": null,
    "codebook_dim": 128,
    "codebook_size": 2048,
    "compress": 2,
    "dilation_growth_rate": 2,
    "dtype": "float16",
    "hidden_size": 128,
    "kernel_size": 7,
    "last_kernel_size": 7,
    "model_type": "encodec",
    "norm_type": "weight_norm",
    "normalize": false,
    "num_filters": 64,
    "num_lstm_layers": 2,
    "num_residual_layers": 1,
    "overlap": null,
    "pad_mode": "reflect",
    "residual_kernel_size": 3,
    "sampling_rate": 32000,
    "target_bandwidths": [
      2.2
    ],
    "trim_right_ratio": 1.0,
    "upsampling_ratios": [
      8,
      5,
      4,
      4
    ],
    "use_causal_conv": false,
    "use_conv_shortcut": false
  },
  "decoder": {
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "attention_dropout": 0.0,
    "audio_channels": 1,
    "classifier_dropout": 0.0,
    "dropout": 0.1,
    "dtype": "float16",
    "ffn_dim": 4096,
    "hidden_size": 1024,
    "initializer_factor": 0.02,
    "layerdrop": 0.0,
    "max_position_embeddings": 2048,
    "model_type": "musicgen_decoder",
    "num_attention_heads": 16,
    "num_codebooks": 4,
    "num_hidden_layers": 24,
    "scale_embedding": false,
    "use_cache": true,
    "vocab_size": 2048
  },
  "dtype": "float16",
  "initializer_factor": 0.02,
  "is_encoder_decoder": true,
  "model_type": "musicgen",
  "text_encoder": {
    "_name_or_path": "t5-base",
    "architectures": [
      "T5ForConditionalGeneration"
    ],
    "classifier_dropout": 0.0,
    "d_ff": 3072,
    "d_kv": 64,
    "d_model": 768,
    "decoder_start_token_id": 0,
    "dense_act_fn": "relu",
    "dropout_rate": 0.1,
    "dtype": "float16",
    "feed_forward_proj": "relu",
    "initializer_factor": 1.0,
    "is_encoder_decoder": false,
    "is_gated_act": false,
    "layer_norm_epsilon": 1e-06,
    "model_type": "t5",
    "n_positions": 512,
    "num_decoder_layers": 12,
    "num_heads": 12,
    "num_layers": 12,
    "output_past": true,
    "relative_attention_max_distance": 128,
    "relative_attention_num_buckets": 32,
    "task_specific_params": {
      "summarization": {
        "early_stopping": true,
        "length_penalty": 2.0,
        "max_length": 200,
        "min_length": 30,
        "no_repeat_ngram_size": 3,
        "num_beams": 4,
        "prefix": "summarize: "
      },
      "translation_en_to_de": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to German: "
      },
      "translation_en_to_fr": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to French: "
      },
      "translation_en_to_ro": {
        "early_stopping": true,
        "max_length": 300,
        "num_beams": 4,
        "prefix": "translate English to Romanian: "
      }
    },
    "use_cache": false,
    "vocab_size": 32128
  },
  "transformers_version": "4.57.2"
}
